Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The zlib extension offers the option to transparently compress your pages on-the-fly, if the requesting browser supports this.
pt_br: A extensão zlib oferece a opção de comprimir transparentemente suas páginas em tempo real, se o navegador requisitante suportar isto.

source: Therefore there are three options in the configuration file php.ini.
pt_br: Então existem três opções no arquivo de configuração php.ini.

source: Zlib Configuration Options
pt_br: Opções de Configuração da Zlib

source: Whether to transparently compress pages.
pt_br: Serve para comprimir páginas de modo transparente.

source: If this option is set to "On" in php.ini or the Apache configuration, pages are compressed if the browser sends an "Accept-Encoding: gzip "or "deflate" header. "Content-Encoding: gzip "(respectively "deflate") and "Vary:
pt_br: Se esta opção for mudada para "On" no php.ini ou na configuração do Apache, as páginas serão comprimidas se o navegador enviar um cabeçalho "Accept-Encoding: gzip "ou "deflate". "Content-Encoding: gzip" (respectivamente "deflate") e cabeçalhos "Vary:

source: Accept-Encoding "headers are added to the output.
pt_br: Accept-Encoding "serão adicionados para a saida.

source: You can use ini_set() to disable this in your script if the headers aren't already sent.
pt_br: Você pode usar a função ini_set() para desabilitar isto em seu script se os cabeçalhos ainda não foram enviados.

source: If you output a "Content-Type: image /" header the compression is disabled, too (in order to circumvent a Netscape bug).
pt_br: Se você enviar um cabeçalho à saída "Content-Type: image /" a compressão será desabilitada, também (para corrigir um defeito do Netscape).

source: You can reenable it, if you add "ini_set('zlib.output_compression', 'On')" after the header call which added the image content-type.
pt_br: Você pode reabilitar isto, se você adicionar a função "ini_set('zlib.output_compression', 'On')" depois da chamada do cabeçalho que que foi adicionado o content-type da imagem.

source: This option also accepts integer values instead of boolean "On" / "Off", using this you can set the output buffer size (default is 4KB).
pt_br: Esta opção também aceita valores inteiros em vez de valores booleanos "On" / "Off", usando isto você pode configurar o tamanho do buffer de saída (o padrão é 4KB).

source: Instead you must use zlib.output_handler.
pt_br: Em vez disto você deve usar zlib.output_handler.

source: Compression level used for transparent output compression.
pt_br: Nível de compressão usado para as saídas.

source: You cannot specify additional output handlers if zlib.output_compression is activated here.
pt_br: Você não pode especificar tratamentos adicionais de saída se zlib.output_compression for ativado.

source: This setting does the same as output_handler but in a different order.
pt_br: Tipos Resource

source: This example opens a temporary file and writes a test string to it, then it prints out the content of this file twice.
pt_br: Este exemplo abre um arquivo temporário e gera uma string teste dentro dele, então ela mostra o conteúdo deste arquivo duas vezes.

source: Small Zlib Example
pt_br: Pequeno Exemplo das funções Zlib

source: ?php $filename = tempnam ('/ tmp', 'zlibtest') .'.gz'; print "html \n head / head \n body \n pre \n"; $s = "Only a test, test, test, test, test, test, test, test!\n"; / / open file for writing with maximum compression $zp = gzopen($filename, "w9"); / / write string to file gzwrite($zp, $s); / / close file gzclose($zp); / / open file for reading $zp = gzopen($filename, "r"); / / read 3 char print gzread($zp, 3); / / output until end of the file and close it. gzpassthru($zp); print "\n"; / / open file and print content (the 2nd time). if (readgzfile($filename) != strlen($s)) {echo "Error with zlib functions !";} unlink($filename); print" / pre \n / h1 / body \n / html \n";?
pt_br: ?php $filename = tempnam ('/ tmp', 'zlibteste') .'.gz'; print "html \n head / head \n body \n pre \n"; $s = "Somente um teste, teste, teste, teste, teste, teste, teste, teste!\n"; / / abre o arquivo para gerar ele com a compressão máxima $zp = gzopen($filename, "w9"); / / escreve a string no arquivo gzwrite($zp, $s); / / fecha o arquivo gzclose($zp); / / abre o arquivo para leitura $zp = gzopen($filename, "r"); / / lê 3 caracteres print gzread($zp, 3); / / mostra o conteúdo até o fim do arquivo e o fecha. gzpassthru($zp); print "\n"; / / abre o arquivo e imprime o conteúdo dele (pela segunda vez). if (readgzfile($filename) != strlen($s)) {echo "Erro com as funções zlib !";} unlink($filename); print" / pre \n / h1 / body \n / html \n";?

source: Appendix G.
pt_br: Apêndice G.

source: These classes are defined in the standard set of functions included in the PHP build.
pt_br: Classes padrão

source: The class from which dir() is instantiated.
pt_br: A classe de onde a função dir() é instanciada.

source: These classes are defined in the Ming extension, and will only be available when that extension has either been compiled into PHP or dynamically loaded at runtime.
pt_br: Estas classes são definidas na extensão Ming, e somente estarão disponíveis quando esta extensão for compilada dento do PHP ou carregada em tempo de execução.

source: These classes are defined in the Oracle 8 extension, and will only be available when that extension has either been compiled into PHP or dynamically loaded at runtime.
pt_br: Estas classes são definidas na extensão Oracle 8, e somente estarão disponíveis quando esta extensão for compilada dento do PHP ou carregada em tempo de execução.

source: These classes are defined in the qtdom extension, and will only be available when that extension has either been compiled into PHP or dynamically loaded at runtime.
pt_br: Estas classes são definidas na extensão qtdom e somente estarão disponíveis quando esta extensão for compilada dento do PHP ou carregada em tempo de execução.

source: Predefined Variables
pt_br: Variáveis predefinidas

source: Predefined Constants
pt_br: Constantes Predefinidas

source: These constants are defined by the PHP core.
pt_br: Core Predefined Constants - - Constants defined in the PHP core, Zend, and SAPI modules

source: Predefined Classes
pt_br: Classes pre-definidas

source: These constants are defined in PHP by default.
pt_br: Standard Predefined Constants - - Constants defined in PHP by default

source: The following is a listing of predefined identifiers in PHP.
pt_br: Palavras reservadas do PHP

source: None of the identifiers listed here should be used as identifiers in a your scripts.
pt_br: Nenhum dos identificadores listados aqui pode ser utilizado como seus identificadores nos scripts.

source: These lists include keywords and predefined variable, constant, and class names.
pt_br: Esta lista ainda não está completa.

source: These lists are neither exhaustive or complete.
pt_br: Lista de palavras-chave (keywords)

source: These words have special meaning in PHP.
pt_br: Estas palavras tem um significado especial no PHP.

source: Some of them represent things which look like functions, some look like constants, and so on--but they 're not, really: they are language constructs.
pt_br: Algumas delas representam coisas que parecem funções, algumas parecem constantes mas na verdade não o são realmente: elas são construtores de linguagem.

source: You cannot use any of the following words as constants, class names, or function names.
pt_br: Você não pode usar nenhuma das seguintes palavras como constantes, nomes de classes ou de funções.

source: Using them as variable names is generally OK, but could lead to confusion.
pt_br: Utilizar como nome de variáveis geralmente não causa erros, mas pode levar a confusão.

source: Table G-1.
pt_br: Tabela G-1.

source: PHP Keywords
pt_br: Palavras-chave do PHP

source: Introduced in 4.1.0.
pt_br: Variáveis do servidor: $_SERVER

source: In earlier versions, use $HTTP_SERVER_VARS.
pt_br: Introduzida na versão 4.1.0.

source: $_SERVER is an array containing information such as headers, paths, and script locations.
pt_br: $_SERVER é um array contendo informações como headers, caminhos e localizações do script.

source: The entries in this array are created by the webserver.
pt_br: Os itens deste array são criados pelo servidor web.

source: There is no guarantee that every webserver will provide any of these; servers may omit some, or provide others not listed here.
pt_br: Não há garantias que todos os servidores web geram todas elas: alguns servidores talvez omitam algumas ou geram outras que não estão listadas aqui.

source: That said, a large number of these variables are accounted for in the CGI 1.1 specification, so you should be able to expect those.
pt_br: Mesmo assim, um grande número dessas variáveis estão de acordo com a especificação CGI 1.1, então você pode esperar encontrá-las nesse array.

source: This is a 'superglobal', or automatic global, variable.
pt_br: Esta é uma variável 'superglobal', ou automaticamente global.

source: This simply means that it is available in all scopes throughout a script.
pt_br: Isto significa que ela é disponível em todos os escopos (níveis) de um script.

source: You don' t need to do a global $_SERVER; to access it within functions or methods, as you do with $HTTP_SERVER_VARS.
pt_br: Você não precisa fazer um global $_SERVER; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_SERVER_VARS.

source: $HTTP_SERVER_VARS contains the same initial information, but is not an autoglobal. (Note that $HTTP_SERVER_VARS and $_SERVER are different variables and that PHP handles them as such)
pt_br: $HTTP_SERVER_VARS contém a mesmas informações, mas ela não é uma superglobal .( Note que $HTTP_SERVER_VARS e $_SERVER são variáveis diferentes como também o PHP as manipula diferentemente)

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_SERVER and $HTTP_SERVER_VARS arrays.
pt_br: Se a diretiva register_globals está ativa, então essas variáveis tornam-se disponíveis no escopo global do script (por exemplo, separados dos arrays $_SERVER e $HTTP_SERVER_VARS.

source: For related information, see the security chapter titled Using Register Globals.
pt_br: Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.

source: These individual globals are not autoglobals.
pt_br: Estas variáveis globais individuais não são superglobais.

source: You may or may not find any of the following elements in $_SERVER.
pt_br: Você poderá ou não encontrar qualquer um dos seguintes elementos dentro de $_SERVER.

source: Note that few, if any, of these will be available (or indeed have any meaning) if running PHP on the command line.
pt_br: Note que poucos (ou nenhum) deles estão disponíveis (ou não terão qualquer sentido) se você estiver rodando o PHP na linha de comando.

source: The filename of the currently executing script, relative to the document root.
pt_br: O nome do arquivo do script atualmente em uso, relativo ao document root.

source: For instance, $_SERVER[ 'PHP_SELF'] in a script at the address http: / /example.com / test.php / foo.bar would be / test.php / foo.bar.
pt_br: Por exemplo, $_SERVER[ 'PHP_SELF'] em um script com o endereço http: / /example.com / test.php / foo.bar pode ser / test.php / foo.bar.

source: If PHP is running as a command-line processor, this variable is not available.
pt_br: Se estiver rodando o PHP em linha de comando, esta variável não está disponível.

source: Array of arguments passed to the script.
pt_br: Array de argumentos passado para o script.

source: When the script is run on the command line, this gives C-style access to the command line parameters.
pt_br: Quando o script é executado na linha de comando, isto permite um acesso aos parâmetros de linha de comando no estilo do C.

source: When called via the GET method, this will contain the query string.
pt_br: Quando chamado via método GET, ele conterá a query string.

source: Contains the number of command line parameters passed to the script (if run on the command line).
pt_br: Contém o número de parâmetros da linha de comando passados para o script (se executando da linha de comando).

source: What revision of the CGI specification the server is using; i.e. 'CGI / 1.1'.
pt_br: O número de revisão da especificação CGI que o servidor está utilizando, por exemplo: 'CGI / 1.1'.

source: The name of the server host under which the current script is executing.
pt_br: O nome host do servidor onde o script atual é executado.

source: If the script is running on a virtual host, this will be the value defined for that virtual host.
pt_br: Se o script está rodando em um host virtual, este será o valor definido para aquele host virtual.

source: Server identification string, given in the headers when responding to requests.
pt_br: A string de identificação do servidor, fornecida nos headers quando respondendo a requests.

source: Name and revision of the information protocol via which the page was requested; i.e. 'HTTP / 1.0';
pt_br: Nome e número de revisão do protocolo de informação pelo qual a página foi requerida, por exemplo 'HTTP / 1.0';

source: Which request method was used to access the page; i.e. 'GET', 'HEAD', 'POST', 'PUT'.
pt_br: Geralmente 'GET', 'HEAD', 'POST' ou 'PUT'.

source: The query string, if any, via which the page was accessed.
pt_br: A query string (string de solicitação), se houver, pela qual a página foi acessada.

source: The document root directory under which the current script is executing, as defined in the server 's configuration file.
pt_br: O diretório raiz sob onde o script atual é executado, como definido no arquivos de configuração do servidor.

source: Contents of the Accept: header from the current request, if there is one.
pt_br: O conteúdo do header Accept: da requisição atual, se houver.

source: Contents of the Accept-Charset: header from the current request, if there is one.
pt_br: O conteúdo do header Accept-Charset: da requisição atual, se houver.

source: Example: 'iso-8859-1,*,utf-8'.
pt_br: Exemplo: 'iso-8859-1,*,utf-8'.

source: Contents of the Accept-Encoding: header from the current request, if there is one.
pt_br: O conteúdo do header Accept-Encoding: da requisição atual, se houver.

source: Example: 'gzip'.
pt_br: Exemplo: 'gzip'.

source: Contents of the Accept-Language: header from the current request, if there is one.
pt_br: O conteúdo do header Accept-Language: da requisição atual, se houver.

source: Example: 'en'.
pt_br: Exemplo 'en'.

source: Contents of the Connection: header from the current request, if there is one.
pt_br: O conteúdo do header Connection: da requisição atual, se houver.

source: Example: 'Keep-Alive'.
pt_br: Exemplo: 'Keep-Alive'.

source: Contents of the Host: header from the current request, if there is one.
pt_br: O conteúdo do header Host: da requisição atual, se houver.

source: The address of the page (if any) which referred the user agent to the current page.
pt_br: O endereço da página (se houver) através da qual o agente do usuário acessou a página atual.

source: This is set by the user agent.
pt_br: Essa diretiva é informada pelo agente do usuário.

source: Not all user agents will set this, and some provide the ability to modify HTTP_REFERER as a feature.
pt_br: Nem todos os browsers geram esse header, e alguns ainda possuem a habilidade de modificar o conteúdo do HTTP_REFERER como recurso.

source: In short, it cannot really be trusted.
pt_br: Em poucas palavras, não é confiável.

source: Contents of the User_Agent: header from the current request, if there is one.
pt_br: O conteúdo do header User_Agent: da requisição atual, se houver.

source: This is a string denoting the user agent being which is accessing the page.
pt_br: É uma string denotando o agente de usuário pelo qual a página é acessada.

source: A typical example is:
pt_br: Um exemplo típico é:

source: Among other things, you can use this value with get_browser() to tailor your page's output to the capabilities of the user agent.
pt_br: Além de outras coisas, você pode utilizar este valor com get_browser() para personalizar a geração de suas páginas para as capacidades do agente do usuário.

source: The IP address from which the user is viewing the current page.
pt_br: O endereço IP de onde o usuário está visualizado a página atual.

source: The Host name from which the user is viewing the current page.
pt_br: A porta TCP na máquina do usuário utilizada para comunicação com o servidor web.

source: The reverse dns lookup is based off the REMOTE_ADDR of the user.
pt_br: O caminho absoluto o script atualmente em execução.

source: Your web server must be configured to create this variable.
pt_br: O valor fornecido pela diretiva SERVER_ADMIN (do Apache) no arquivo de configuração do servidor.

source: See also gethostbyaddr().
pt_br: Se o script está sendo executado em um host virtual, este será os valores definidos para aquele host virtual.

source: The port being used on the user 's machine to communicate with the web server.
pt_br: A porta na máquina servidora utilizada pelo servidor web para comunicação.

source: The absolute pathname of the currently executing script.
pt_br: Como default, este valor é '80'.

source: The value given to the SERVER_ADMIN (for Apache) directive in the web server configuration file.
pt_br: Utilizando SSL, entretanto, mudará esse valor para a porta de comunicação segura HTTP.

source: The port on the server machine being used by the web server for communication.
pt_br: String contendo a versão do servidor e nome do host virtual que é adicionado às páginas geradas no servidor, se ativo.

source: String containing the server version and virtual host name which are added to server-generated pages, if enabled.
pt_br: Contém o caminho completo do script atual.

source: Contains the current script 's path.
pt_br: O URI fornecido para acessar a página atual, por exemplo, '/ index.html'.

source: The URI which was given in order to access this page; for instance, '/ index.html'.
pt_br: Quando executando sob o Apache como módulo e fazendo autenticaçào HTTP, esta variável estará definida com o username fornecido pelo usuário.

source: When running under Apache as module doing HTTP authentication this variable is set to the username provided by the user.
pt_br: Quando executando sob o Apache como módulo e fazendo autenticaçào HTTP, esta variável estará definida com a senha fornecida pelo usuário.

source: When running under Apache as module doing HTTP authentication this variable is set to the password provided by the user.
pt_br: Quando executando sob o Apache como módulo e fazendo autenticaçào HTTP, esta variável estará definida com o tipo de autenticação utilizado.

source: When running under Apache as module doing HTTP authenticated this variable is set to the authentication type.
pt_br: Variáveis de ambiente: $_ENV

source: In earlier versions, use $HTTP_ENV_VARS.
pt_br: Em versões anteriores, utilize $HTTP_ENV_VARS.

source: These variables are imported into PHP 's global namespace from the environment under which the PHP parser is running.
pt_br: Estas variáveis são importadas dentro no espaço global do PHP do ambiente sob qual o interpretador do PHP está rodando.

source: Many are provided by the shell under which PHP is running and different systems are likely running different kinds of shells, a definitive list is impossible.
pt_br: Muitos são são criados no shell (terminal) sob o qual o PHP é executado e sistemas diferentes normalmente utilizam vários sabores de shells, e uma lista definitiva é impossível.

source: Please see your shell 's documentation for a list of defined environment variables.
pt_br: Verifique a documentação de sua shell para a lista de variáveis ambiente definidas.

source: Other environment variables include the CGI variables, placed there regardless of whether PHP is running as a server module or CGI processor.
pt_br: Outras variáveis ambiente incluem as variáveis CGI, informadas aqui independente do PHP estar rodando como um módulo do servidor ou como processador CGI.

source: You don' t need to do a global $_ENV; to access it within functions or methods, as you do with $HTTP_ENV_VARS.
pt_br: Você não precisa fazer um global $_ENV; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_ENV_VARS.

source: $HTTP_ENV_VARS contains the same initial information, but is not an autoglobal. (Note that HTTP_ENV_VARS and $_ENV are different variables and that PHP handles them as such)
pt_br: $HTTP_ENV_VARS contém a mesma informação, mas não é uma superglobal. (Note que HTTP_ENV_VARS e $_ENV são variáveis diferentes como também o PHP as manipula diferentemente)

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_ENV and $HTTP_ENV_VARS If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_ENV and $HTTP_ENV_VARS arrays.
pt_br: Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.

source: In earlier versions, use $HTTP_COOKIE_VARS.
pt_br: Em versões anteriores, utilize $HTTP_COOKIE_VARS.

source: Automatically global in any scope.
pt_br: Contém um array associativo de variáveis passas para o script atual através de cookies HTTP.

source: You don' t need to do a global $_COOKIE; to access it within functions or methods, as you do with $HTTP_COOKIE_VARS.
pt_br: Você não precisa fazer um global $_COOKIE; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_COOKIE_VARS.

source: $HTTP_COOKIE_VARS contains the same initial information, but is not an autoglobal. (Note that HTTP_COOKIE_VARS and $_COOKIE are different variables and that PHP handles them as such)
pt_br: $HTTP_COOKIE_VARS contém as mesmas informações, mas não é uma superglobal. (Note que HTTP_COOKIE_VARS e $_COOKIE são variáveis diferentes como também o PHP as manipula diferentemente)

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_COOKIE and $HTTP_COOKIE_VARS arrays.
pt_br: Se a diretiva register_globals está ativa, então essas variáveis tornam-se disponíveis no escopo global do script (por exemplo, separados dos arrays $_COOKIE e $HTTP_COOKIE_VARS.

source: In earlier versions, use $HTTP_GET_VARS.
pt_br: Introduzida na versão 4.1.0.

source: You don' t need to do a global $_GET; to access it within functions or methods, as you do with $HTTP_GET_VARS.
pt_br: Você não precisa fazer um global $_GET; para pode acessá-la dentro de funções ou métodos, como era necessário com $HTTP_GET_VARS.

source: $HTTP_GET_VARS contains the same initial information, but is not an autoglobal. (Note that HTTP_GET_VARS and $_GET are different variables and that PHP handles them as such)
pt_br: $HTTP_GET_VARS contém as mesmas informações, mas não é uma superglobal. (Note que HTTP_GET_VARS e $_GET são variáveis diferentes como também o PHP as manipula diferentemente)

source: If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_GET and $HTTP_GET_VARS If the register_globals directive is set, then these variables will also be made available in the global scope of the script; i.e., separate from the $_GET and $HTTP_GET_VARS arrays.
pt_br: Para maiores informações, veja o capítulo de segurança entitulado Utilizando registradores globais.
